QUESTION WEEK 5: USE PANDAS TO CLEAN AND PREPROCESS A MESSY DATASET, DOCUMENTING THE STEP TAKEN DURING THE CLEANING PROCESS?

### *PANDAS*
Pandas is a Python library for data manipulation and analysis, introducing Series and DataFrame data structures. It simplifies tasks like filtering, transforming, and merging, and handles large datasets with tabular data structures. Pandas also offers tools for data cleaning, preprocessing, and normalization.

Pandas Series is a column in a spreadsheet or DataFrame, consisting of labels and data. It can store elements of different data types using dtype (data type) and uses object data type. Pandas Series labels are default index numbers starting from 0.

In [ ]:
import pandas as pd
# create a list
data = [10, 15, 20, 50, 140]
# create a series from the list
a_series = pd.Series(data)

# display third value in the series
print(a_series[3])

50

In [ ]:
import pandas as pd
# create a list
a = [1, 23, 35]
# create a series and specify labels
my_series = pd.Series(a, index = ["x", "y", "z"])

print(my_series)

x     1
y    23
z    35
dtype: int64

In [ ]:
import pandas as pd
# create a dictionary
grades_students = {"Ade1": 4.25, "Bolu2": 2.28, "Alicia3": 4.75}

In [ ]:
# create a series from the dictionary
my_series = pd.Series(grades_students)
# display the series
print(my_series)

Ade1       4.25
Bolu2      2.28
Alicia3    4.75
dtype: float64

Creating a Dictionary dataframe

In [ ]:
import pandas as pd
# create a dictionary
data = {'Name': ['Ummi', 'Aleena', 'Baby'],
       'Age': [32, 20, 37],
       'City': ['Scotland', 'HongKong', 'Alaska']}

In [ ]:
# create a dataframe from the dictionary
df = pd.DataFrame(data)
print(df)

     Name  Age      City
0    Ummi   32  Scotland
1  Aleena   20  HongKong
2    Baby   37    Alaska

Pandas DataFrame using a two-dimensional Python list.

In [ ]:
import pandas as pd
# create a two-dimensional list
data = [['Ummi', 32, 'Scotland'],
       ['Aleena', 20, 'Hongkong'],
       ['Baby', 37, 'Alaska']]

In [ ]:
# create a DataFrame from the list
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
print(df)

     Name  Age      City
0    Ummi   32  Scotland
1  Aleena   20  Hongkong
2    Baby   37    Alaska

Importing Pandas DataFrame From a File. This could be a csv, xls or sql.
JSON, Excel spreadsheet, SQL database, etc. The methods to read different file types are listed below:
JSON - read_json()
Excel spreadsheet - read_excel()
SQL - read_sql()

In [ ]:
import pandas as pd
# read csv file
df = pd.read_csv('Batches.csv')
print(df)

     S/N   LAST NAME      FIRST NAME MIDDLE NAME  MATRIC NUMBER  \
0      1     MESHACH         AKUMABI      ADEJOH            NaN
1      2   ABDULLAHI   UBAIDURRAHMAN    MUHAMMAD            NaN
2      3       YUSUF          FATIMA      BASHIR            NaN
3      4     TIJJANI           YUSUF         ALI            NaN
4      5       YUSUF      ABDULMALIK    MUHAMMAD            NaN
..   ...         ...             ...         ...            ...
140  141     IKELUGO       OGOCHUKWU     THERESA            NaN
141  142      SHITTU           IDRIS     ABIODUN            NaN
142  143  ABDULRAZAQ          MARYAM       IDRIS            NaN
143  144       AMINU   ABDULRASHEED          NaN            NaN
144  145         NaN             NaN         NaN            NaN

     ACCOUNT NUMBER   MATRIC NUMBER.1                 DEPARTMENT  \
0      1.100053e+09   BMS/PHS/22/1029           HUMAN PHYSIOLOGY
1      1.100056e+09   BMS/ANT/22/1024              HUMAN ANATOMY
2      1.100056e+09   BMS/PHS/22/1050           HUMAN PHYSIOLOGY
3      1.100056e+09   CLS/MBB/22/1084           MEDICAL SCIENCES
4      1.100056e+09   CLS/MBB/22/1076           MEDICAL SCIENCES
..              ...               ...                        ...
140    1.100099e+09  FASS/LEN/22/1012      ENGLISH & LINGUISTICS
141    1.100099e+09  FASS/LAR/22/1012         LINGUISTICS ARABIC
142    1.100099e+09   FAG/AEE/19/1072  AGRIC ECONS AND EXTENSION
143    1.100070e+09   FMS/BUS/22/1008     BUSINESS ADMINSTRATION
144             NaN               NaN                        NaN

                     FACULTY                       EmbossLine1  EmbossLine2  \
0      BASIC MEDICAL SCIENCE            MESHACH AKUMABI ADEJOH          NaN
1      BASIC MEDICAL SCIENCE  ABDULLAHI UBAIDURRAHMAN MUHAMMAD          NaN
2      BASIC MEDICAL SCIENCE               YUSUF FATIMA BASHIR          NaN
3           CLINICAL SCIENCE                 TIJJANI YUSUF ALI          NaN
4           CLINICAL SCIENCE         YUSUF ABDULMALIK MUHAMMAD          NaN
..                       ...                               ...          ...
140  ARTS AND SOCIAL SCIENCE         IKELUGO OGOCHUKWU THERESA          NaN
141  ARTS AND SOCIAL SCIENCE              SHITTU IDRIS ABIODUN          NaN
142              AGRICULTURE            ABDURAZAK MARYAM IDRIS          NaN
143       MANAGEMENT SCIENCE              AMINU ABDURLRASHEED           NaN
144                      NaN                               NaN          NaN

    Address1   City Country   State   MobilePhone
0        FUD  DUTSE      NG  JIGAWA  9.161972e+09
1        FUD  DUTSE      NG  JIGAWA  7.041891e+09
2        FUD  DUTSE      NG  JIGAWA  9.038400e+09
3        FUD  DUTSE      NG  JIGAWA  7.066757e+09
4        FUD  DUTSE      NG  JIGAWA  9.073632e+09
..       ...    ...     ...     ...           ...
140      FUD  DUTSE      NG  JIGAWA  8.065936e+09
141      FUD  DUTSE      NG  JIGAWA  8.162587e+09
142      FUD  DUTSE      NG  JIGAWA  8.067457e+09
143      FUD  DUTSE      NG  JIGAWA           NaN
144      NaN    NaN     NaN     NaN           NaN

[145 rows x 16 columns]

The data set in the Csv file uploaded successfully printed giving the summary of the total rows and columns in the file.

Pandas can also enable us read_csv() Syntax. Example below


### Write to CSV Files
Pandas offers the read_csv() function for reading data from a CSV file into a DataFrame, and the to_csv() function for writing data from a DataFrame into a CSV file.

In [ ]:
import pandas as pd
# create a dictionary
data = {'Name': ['Ade', 'Auwal', 'Balarabe'],
        'Age': [25, 30, 35],
        'City': ['Norway', 'Lagos', 'Penelope']}

In [ ]:
# create a dataframe from the dictionary
df = pd.DataFrame(data)

In [ ]:
# write dataframe to csv file
df.to_csv('output.csv', index=False)
print(df)

       Name  Age      City
0       Ade   25    Norway
1     Auwal   30     Lagos
2  Balarabe   35  Penelope

### **to_csv() With Arguments**
Creating a dataframe with the to_csv() arguments

In [ ]:
import pandas as pd
# create dataframe
data = {'Name': ['Tola', 'Nife', 'Jide', 'Tife'],
        'Age': [20, 21, 19, 18],
        'City': ['New York', 'London', 'Paris', 'Berlin']}
df = pd.DataFrame(data)
# write to csv file
df.to_csv('output.csv', sep = ';', index = False, header = True)
print(df)

   Name  Age      City
0  Tola   20  New York
1  Nife   21    London
2  Jide   19     Paris
3  Tife   18    Berlin

## PANDAS DATA CLEANING
Data cleaning means fixing and organizing messy data. Pandas provides various tools for data cleaning, including removing irrelevant columns, renaming column names, ensuring consistency in data values, and replacing missing values.
Missing values, often represented as NaN (Not a Number), can cause problems during data processing and analysis. These gaps in data can lead to incorrect analysis and misleading conclusions.

Data cleaning Rows With Missing Values using the dropna() function.

In [ ]:
import pandas as pd
# define a dictionary with sample data which includes some missing values
data = {
    'A': [10, 20, 30, None, 50],
    'B': [None, 25, 35, 40, 55],
    'C': [15, 23, None, None, 65]
}

In [ ]:
df = pd.DataFrame(data)
print("Original Data:\n",df)
print()

Original Data:
       A     B     C
0  10.0   NaN  15.0
1  20.0  25.0  23.0
2  30.0  35.0   NaN
3   NaN  40.0   NaN
4  50.0  55.0  65.0

In [ ]:
# use dropna() to remove rows with any missing values
df_cleaned = df.dropna()

print("Cleaned Data:\n",df_cleaned)

Cleaned Data:
       A     B     C
1  20.0  25.0  23.0
4  50.0  55.0  65.0

Fill Missing Values using the fillna() function

In [ ]:
import pandas as pd
# define a dictionary with sample data which includes some missing values
data = {
    'Ade': [1, 2, 3, None, 5],
    'Bolu': [None, 2, 3, 4, 5],
    'Caleb': [1, 2, None, None, 5]
}
df = pd.DataFrame(data)
print("Original Data:\n", df)

Original Data:
    Ade  Bolu  Caleb
0  1.0   NaN    1.0
1  2.0   2.0    2.0
2  3.0   3.0    NaN
3  NaN   4.0    NaN
4  5.0   5.0    5.0

In [ ]:
# filling NaN values with 0
df.fillna(7, inplace=True)

print("\nData after filling NaN with 7:\n", df)

Data after filling NaN with 7:
    Ade  Bolu  Caleb
0  1.0   7.0    1.0
1  2.0   2.0    2.0
2  3.0   3.0    7.0
3  7.0   4.0    7.0
4  5.0   5.0    5.0

Instead of returning a new DataFrame with the alterations, the operation will alter the DataFrame directly because the inplace=True option is present.

The missing value cells can also be filled wthe aggregate functions to fill.
Filling the dataframe with the mode.

In [ ]:
import pandas as pd
# define a dictionary with sample data which includes some missing values
data = {
    'Ade': [1, 2, 3, None, 5, 5],
    'Bolu': [None, 2, 3, 4, 5, 7],
    'Caleb': [1, 2, None, None, 5, 9]
}

In [ ]:
df = pd.DataFrame(data)
print("Original Data:\n", df)
# filling NaN values with the mode of each column
df.fillna(df.mode(), inplace=True)

print("\nData after filling NaN with mode:\n", df)

Original Data:
    Ade  Bolu  Caleb
0  1.0   NaN    1.0
1  2.0   2.0    2.0
2  3.0   3.0    NaN
3  NaN   4.0    NaN
4  5.0   5.0    5.0
5  5.0   7.0    9.0

Data after filling NaN with mode:
    Ade  Bolu  Caleb
0  1.0   2.0    1.0
1  2.0   2.0    2.0
2  3.0   3.0    5.0
3  NaN   4.0    9.0
4  5.0   5.0    5.0
5  5.0   7.0    9.0

The cell with index 3 still has a NaN because there is no most frequent or hight number of times it appeared in it. We can also use this function to fill with the mean, median or any descriptive statistics of choice.

### CLEANING OF DUPLICATED ROWS
Duplicated rows could occur due to error in the coalition of the dataset. Duplication of a data set will inevitable give error in the results; for this reason there is need to clean the dataset.
In Pandas, to handle duplicate rows, we can use the duplicated() and the drop_duplicates() function.
duplicated() - to check for duplicates
drop_duplicates() - remove duplicate rows

In [ ]:
import pandas as pd

# sample data
data = {
    'Alvin': [1, 2, 3, 3, 4, 4],
    'Quinns': [5, 6, 5, 7, 8, 8]
}
df = pd.DataFrame(data)
print("Original DataFrame:\n", df.to_string(index=False))

Original DataFrame:
  Alvin  Quinns
     1       5
     2       6
     3       5
     3       7
     4       8
     4       8

In [ ]:
# detect duplicates
print("\nDuplicate Rows:\n", df[df.duplicated()].to_string(index=False))

Duplicate Rows:
  Alvin  Quinns
     4       8

In [ ]:
# remove duplicates based on column 'Alvin'
df.drop_duplicates(subset=['Alvin'], keep='first', inplace=True)
print("\nDataFrame after removing duplicates based on column 'Alvin':\n", df.to_string(index=False))

DataFrame after removing duplicates based on column 'Alvin':
  Alvin  Quinns
     1       5
     2       6
     3       5
     4       8

From the above the original dataset had 6 rows and 2 columns, after the cleaning we now have only 4 rows and 2 columns. Cleaning out the duplicated rows and columns.
To find duplicate rows, use df[df.duplicated()] to generate a boolean Series.
Using column Alvin as a guide, df.drop_duplicates(subset=['Alvin'], keep='first', inplace=True) eliminates duplicates, leaving only the first instance of each duplicate in the original DataFrame.

### **Rename Column Names to Meaningful Names**
To rename column names to more meaningful names in Pandas, we can use the rename() function.

In [ ]:
import pandas as pd
# sample data
data = {
    'J': ['Analyst', 'Actor', 'Model', 'Researcher'],
    'T': ['Habib', 'Maria', 'Bahil', 'Zaid'],
    'E': [70000, 30000, 12000, ]
}
df = pd.DataFrame(data)

ValueError: All arrays must be of the same length

The above error occured because the third row of data had 3 variable/values instead of the 4 all the other two has. To correct this we add the value for the forth set

In [ ]:
import pandas as pd
# sample data
data = {
    'J': ['Analyst', 'Actor', 'Model', 'Researcher'],
    'T': ['Habib', 'Maria', 'Bahil', 'Zaid'],
    'E': [70000, 30000, 12000, 50000]
}
df = pd.DataFrame(data)

In [ ]:
# rename columns
df.rename(columns={'J': 'Job', 'T': 'Name', 'E': 'Earnings'}, inplace=True)
print(df.to_string(index=False))

       Job  Name  Earnings
   Analyst Habib     70000
     Actor Maria     30000
     Model Bahil     12000
Researcher  Zaid     50000

Above , the columns of df are renamed from J, T, and E to more meaningful names Job, Name, and Earnings respectively.

## Replace Values Using Another DataFrame
We can replace missing values in one DataFrame using another DataFrame using the fillna() method.

In [ ]:
import pandas as pd
import numpy as np

# create a dataframe with missing values
data1 = {
    'Arewa': [11, 45, np.nan, 47, 67],
    'Bidemi': [np.nan, 20, 35, 48, 50],
    'Cutie': [10, 20, 33, np.nan, 25],
    'Darling': [15, 26, 31, 40, 52]
}
df1 = pd.DataFrame(data1)

In [ ]:
# create datframe to fill the missing values with
data2 = {
    'Arewa': [10, 20, 30, 40, 50],
    'Bidemi': [10, 20, 30, 40, 50],
    'Cutie': [10, 20, 30, 40, 50],
    'Darling': [10, 20, 30, 40, 50]
}
df2 = pd.DataFrame(data2)

In [ ]:
# replace missing values
df1.fillna(df2, inplace=True)
print(df1)

   Arewa  Bidemi  Cutie  Darling
0   11.0    10.0   10.0       15
1   45.0    20.0   20.0       26
2   30.0    35.0   33.0       31
3   47.0    48.0   40.0       40
4   67.0    50.0   25.0       52

The dataframe in the dfq that has NaN in it has been replaced by those of the same cell in the df2 function.

HANDLING WRONG DATA
Errors in a dataset, such as human error or data from shady sources, can significantly compromise the accuracy and dependability of the data analysis.

In [2]:
import pandas as pd
# create dataframe
data = {
    'Name': ['Hauwa', 'Hannan', 'Tahir', 'Aleena', 'Rahama'],
    'Age': [11, 9, 12, 80, 100],
    'Gender': ['F', 'F', 'F', 'F', 'F'],
    'Standard': [13, 14, 12, 30, 15]
}
df = pd.DataFrame(data)
print(df)

     Name  Age Gender  Standard
0   Hauwa   11      F        13
1  Hannan    9      F        14
2   Tahir   12      F        12
3  Aleena   80      F        30
4  Rahama  100      F        15

Noticing that the indexed cell 2 has a wrong data of 'F' instead of 'M'. This can be corrrected using the df.loc[ ] function. While this method is effective for small datasets, it becomes tedious as the size of the dataset grows.

In [3]:
# replace F with M
df.loc[2, 'Gender'] = 'M'
print(df)

     Name  Age Gender  Standard
0   Hauwa   11      F        13
1  Hannan    9      F        14
2   Tahir   12      M        12
3  Aleena   80      F        30
4  Rahama  100      F        15

## Replace Values Based on a Condition
Replace values based on a condition by iterating through them to check if the condition is met. For instance, the maximum age of students in an elementary school is 14.

In [6]:
import pandas as pd
# create dataframe
data = {
    'Name': ['Hauwa', 'Hannan', 'Tahir', 'Aleena', 'Rahama'],
    'Age': [11, 9, 12, 80, 100],
    'Gender': ['F', 'F', 'M', 'F', 'F']
}
df = pd.DataFrame(data)
print(df)

     Name  Age Gender
0   Hauwa   11      F
1  Hannan    9      F
2   Tahir   12      M
3  Aleena   80      F
4  Rahama  100      F

In [7]:
# Replace values based on conditions
for i  in df.index:
    age_val = df.loc[i, 'Age']
    if (age_val > 14) and (age_val%10 == 0):
        df.loc[i, 'Age'] = age_val/10
print(df)

     Name  Age Gender
0   Hauwa   11      F
1  Hannan    9      F
2   Tahir   12      M
3  Aleena    8      F
4  Rahama   10      F

The above code has corrected the anormaly of the ages greater than 14 where 80 and 100 have been corrected to 8  and 10 respectively.